import { faHome } from '@fortawesome/free-solid-svg-icons';
import { FontAwesomeIcon } from '@fortawesome/react-fontawesome';
import { useRouter } from '@hooks/user-router';
import { Box, Card, CardContent, Stack, Typography } from '@mui/material';
import Grid from '@mui/material/Grid2';
import { paths } from '@renderer/paths';

const CancellationPoliciesPage = () => {
  const router = useRouter();

  return (
    <>
      <Box
        display="flex"
        flexDirection="row"
        justifyContent="start"
        alignItems="center"
        paddingY="30px"
        gap="8px"
      >
        <Typography variant="h6">ข้อกำหนดการยกเลิกการให้บริการ SmartRMS</Typography>
        <Typography>|</Typography>
        <FontAwesomeIcon
          icon={faHome}
          onClick={() => router.push(paths.home)}
          style={{
            cursor: 'pointer',
          }}
        />
      </Box>
      <Card
        elevation={14}
        sx={{
          marginBottom: '30px',
        }}
      >
        <CardContent>
          <Grid
            container
            spacing={2}
          >
            <Grid size={{ xs: 12 }}>
              <Stack sx={{ padding: 2, gap: '10px' }}>
                <Box>
                  การผิดหน้าที่ใดๆ ที่ระบุไว้ตามรายละเอียดด้านล่าง SmartRMS
                  มีสิทธิเด็ดขาดในการระงับการให้บริการชั่วคราว
                  หรือมีสิทธิบอกเลิกสัญญาโดยไม่ต้องแจ้งให้ทราบล่วงหน้าและไม่ต้องคืนค่าบริการใดๆทั้งสิ้น
                </Box>
                <Typography
                  sx={{
                    textIndent: '20px',
                    lineHeight: 1.5,
                    overflowWrap: 'break-word',
                  }}
                >
                  1. ท่านมีสิทธิใช้บริการของ SmartRMS
                  เพื่อจัดการธุรกิจให้เช่าตามปกติธรรมดาการค้าของท่านโดยสุจริต
                  และชอบด้วยกฏหมายเท่านั้น ทั้งนี้ท่านจะต้องไม่ใช้บริการของ SmartRMS
                  เพื่อสนับสนุนหรือใช้ในทางที่เกี่ยวข้องกับการหรือกิจการใดๆอันมีวัตถุประสงค์ต้องห้ามชัดแจ้งตามกฏหมายไทย
                  หรือขัดต่อศีลธรรมอันดีของประชาชนชาวไทย หรือที่สร้างความเสื่อมเสีย
                  หรือทำลายความมั่นคงต่อประเทศชาติ ศาสนา และ สถาบันพระมหากษัตริย์ ทั้งนี้
                  หากมีการตรวจพบการกระทำดังกล่าว SmartRMS
                  ขอสงวนสิทธิในการบอกเลิกสัญญาโดยมิต้องแจ้งล่วงหน้าและไม่คืนค่าบริการใดๆทั้งสิ้นและ
                  ไม่มีความรับผิดต่อความเสียหายใดๆต่อตัวผู้ฝ่าฝืนหรือบุคคลภายนอก
                </Typography>
                <Typography
                  sx={{
                    textIndent: '20px',
                    lineHeight: 1.5,
                    overflowWrap: 'break-word',
                  }}
                >
                  2. ท่านจะต้องไม่ส่งข้อมูลใดๆเข้ามาในระบบของ SmartRMS อันเป็นความผิดตาม พ.ร.บ
                  คอมพิวเตอร์ พ.ศ. 2550 มาตรา 14 ที่บัญญัติไว้ว่า
                  "ผู้ใดกระทำความผิดที่ระบุไว้ดังต่อไปนี้ ต้องระวางโทษจำคุกไม่เกินห้าปี
                  หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ (๑)
                  นำเข้าสู่ระบบคอมพิวเตอร์ซึ่งข้อมูลคอมพิวเตอร์ปลอมไม่ว่าทั้งหมดหรือบางส่วน
                  หรือข้อมูลคอมพิวเตอร์อันเป็นเท็จโดยประการที่น่าจะเกิดความเสียหายแก่ผู้อื่นหรือประชาชน
                  (๒)นำเข้าสู่ระบบคอมพิวเตอร์ซึ่งข้อมูลคอมพิวเตอร์อันเป็นเท็จ
                  โดยประการที่น่าจะเกิดความเสียหายต่อความมั่นคงของประเทศหรือก่อให้เกิดความตื่นตระหนกแก่ประชาชน
                  (๓) นำเข้าสู่ระบบคอมพิวเตอร์ซึ่งข้อมูลคอมพิวเตอร์ใดๆ
                  อันเป็นความผิดเกี่ยวกับความมั่นคงแห่งราชอาณาจักรหรือความผิดเกี่ยวกับการก่อการร้ายตามประมวลกฎหมายอาญา
                  (๔) นำเข้าสู่ระบบคอมพิวเตอร์ซึ่งข้อมูลคอมพิวเตอร์ใดๆ
                  ที่มีลักษณะอันลามกและข้อมูลคอมพิวเตอร์นั้นประชาชนทั่วไปอาจเข้าถึงได้ (๕)
                  เผยแพร่หรือส่งต่อซึ่งข้อมูลคอมพิวเตอร์โดยรู้อยู่แล้วว่าเป็นข้อมูลคอมพิวเตอร์ตาม
                  (๑)(๒) (๓) หรือ (๔)"
                </Typography>
                <Typography
                  sx={{
                    textIndent: '20px',
                    lineHeight: 1.5,
                    overflowWrap: 'break-word',
                  }}
                >
                  3.
                  ท่านจะต้องไม่พยายามหรือกระทำการใดๆที่เป็นอันตรายต่อความปลอดภัยของระบบคอมพิวเตอร์หรือระบบเน็ตเวิร์คของ
                  SmartRMS และของบุคคลภายนอกที่ SmartRMS ได้ใช้ประกอบการให้บริการ
                </Typography>
                <Typography
                  sx={{
                    textIndent: '20px',
                    lineHeight: 1.5,
                    overflowWrap: 'break-word',
                  }}
                >
                  4.
                  ท่านจะต้องไม่พยายามหรือกระทำการใดๆเพื่อเข้าถึงส่วนใดๆของเว็บไซต์โดยปราศจากอำนาจในการกระทำเช่นว่า
                  เว้นแต่ท่านได้รับอนุญาตโดยชัดแจ้งให้ทำได้
                </Typography>
                <Typography
                  sx={{
                    textIndent: '20px',
                    lineHeight: 1.5,
                    overflowWrap: 'break-word',
                  }}
                >
                  5. ท่านจะต้องไม่ส่งหรือป้อนข้อมูล
                  หรือเอกสารใดๆเข้ามาในเวบไซด์โดยประการที่อาจทำให้เกิดความเสียหายแก่อุปกรณ์
                  ฮาร์ดแวร์ หรือ ซอฟท์แวร์ ของ SmartRMS หรือ ของบุคคลภายนอกที่ SmartRMS
                  ได้ใช้ประกอบการให้บริการ หรือของสมาชิกท่านอื่น ข้อความนี้ให้รวมถึง
                  การส่งหรือป้อนข้อมูลหรือเอกสารใดที่ละเมิดต่อกฏหมาย หรือ
                  ที่ท่านไม่มีสิทธิจะใช้ตามกฏหมาย
                </Typography>
                <Typography
                  sx={{
                    textIndent: '20px',
                    lineHeight: 1.5,
                    overflowWrap: 'break-word',
                  }}
                >
                  6. ในกรณีที่มีบุคคลอื่นใช้สิทธิเรียกร้องหรือมีข้อเรียกร้องต่อท่าน
                  หรือท่านถูกฟ้องร้องดำเนินคดีเกี่ยวกับหรือมีสาเหตุมาจากการใช้บริการของ SmartRMS
                  ท่านจะยุติข้อเรียกร้องด้วยค่าใช้จ่ายและความรับผิดชอบของท่านเอง และท่านจะไม่ให้
                  SmartRMS เข้าไปเกี่ยวข้องในการยุติข้อเรียกร้องดังกล่าว
                </Typography>
                <Typography
                  sx={{
                    textIndent: '20px',
                    lineHeight: 1.5,
                    overflowWrap: 'break-word',
                  }}
                >
                  7.
                  หากท่านกำหนดให้ผู้ใช้บริการรายอื่นหรือบุคคลภายนอกเข้ามีส่วนร่วมในการดูแลจัดการบัญชีของท่าน
                  บริษัทจะถือว่าการปฏิบัติของบุคคลภายนอกดังกล่าวคือการปฏิบัติของท่าน
                  หากการปฏิบัติของบุคคลดังกล่าวก่อให้เกิดความเสียหายหรือการเสียผลประโยชน์แก่ท่าน
                  บริษัทจะไม่รับผิดชอบใดๆทั้งสิ้น
                </Typography>
                <Typography
                  sx={{
                    textIndent: '20px',
                    lineHeight: 1.5,
                    overflowWrap: 'break-word',
                  }}
                >
                  8. หากท่านไม่ลงทะเบียนเข้าใช้งานและหรือ ไม่กระทำการใด ๆ กับ SmartRMS ไม่ว่าจะผ่าน
                  เว็บไซต์ หรือ Mobile application รวมถึงช่องทางอื่น ๆ ในระยะเวลา 90 วัน SmartRMS
                  มีสิทธ์ในการยกเลิกการใช้งาน หรือปิดบัญชีผู้ใช้งานของท่าน และหรือ
                  บัญชีผู้ใช้งานอื่น ๆ ที่มีส่วนเกียวข้องกับบัญชีผู้ใช้งานของท่านทั้งหมดทันที
                  โดยไม่ต้องแจ้งให้ทราบล่วงหน้า
                </Typography>
                <Typography
                  sx={{
                    textIndent: '20px',
                    lineHeight: 1.5,
                    overflowWrap: 'break-word',
                  }}
                >
                  9. การยกเลิกการระงับใช้บริการใด ๆ ของ SmartRMS ตามข้อที่ 8
                  อันเป็นเหตุให้บัญชีผู้ใช้งานที่เกี่ยวข้องไม่สามารถใช้งานได้ SmartRMS
                  จะไม่มีการนำเข้าข้อมูลใด ๆ อันเกี่ยวเนื่องกับบัญชีผู้ใช้งานที่ถูกระงับ
                  กลับมาใช้ใหม่ทั้งสิ้น
                </Typography>
                <Typography
                  sx={{
                    textIndent: '20px',
                    lineHeight: 1.5,
                    overflowWrap: 'break-word',
                  }}
                >
                  10. การนำเข้าข้อมูลใด ๆ ในระบบหากตรวจสอบพบภายหลังว่าเป็นข้อมูลเท็จ และหรือ
                  เป็นข้อมูลที่ไม่มีอยู่จริง และหรือ ติดตามไม่ได้
                  หรือข้อมูลของบุคคลอื่นที่ยืนยันตัวตนว่าเป็นข้อมูลของบุคคลอื่นจริง ทาง SmartRMS
                  จะทำการปิดการเข้าถึงการใช้งาน และระงับการใช้งานของท่านทันที ที่ตรวจพบ โดย SmartRMS
                  ไม่จำเป็นต้องแจ้งให้ทราบล่วงหน้า
                </Typography>
                <Typography
                  sx={{
                    textIndent: '20px',
                    lineHeight: 1.5,
                    overflowWrap: 'break-word',
                  }}
                >
                  11. หากท่านลงทะเบียนเข้าใช้งานแล้ว ทาง SmartRMS
                  ตรวจสอบพบว่าข้อมูลที่ท่านนำเข้าระบบเป็นข้อมูลที่ไม่สามารถตรวจสอบได้ และหรือ
                  ติดตามสอบถามการใช้งานได้ SmartRMS จะทำการระงับบัญชีผู้ใช้งานชั่วคราวทันที
                  หากไม่มีการติดต่อกลับมาจากผู้ใช้งานภายในระยะเวลา 5 วันทำการ
                  Sข้อมูลบัญชีผู้ใช้งานจะถูกลบทันที และไม่สามารถกู้ข้อมูลกลับมาใหม่ได้
                </Typography>
              </Stack>
            </Grid>
          </Grid>
        </CardContent>
      </Card>
    </>
  );
};

export default CancellationPoliciesPage;
